<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Bluescape desktop app.</string>
        <key>Identifier</key>
        <string>com.github.gregneagle.download.Bluescape</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Bluescape</string>
            <key>DOWNLOAD_URL</key>
            <string>https://bluescape-client.s3.amazonaws.com/releases/prod/mac/BluescapeInstaller.dmg</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>requirement</key>
                    <string>identifier "com.bluescape.nativeclient" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = R4YWX46XBR</string>
                    <key>input_path</key>
                    <string>%pathname%/Bluescape.app</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
