<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Bluescape desktop app and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.munki.Bluescape</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Bluescape</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps/Bluescape</string>
    <key>pkginfo</key>
    <dict>
        <key>catalogs</key>
        <array>
            <string>testing</string>
        </array>
        <key>category</key>
        <string>Productivity</string>
        <key>description</key>
        <string>Visual collaboration and online whiteboarding.
No more distractions, now you can focus on getting stuff done. Experience virtual collaboration like never before with the Bluescape app.</string>
        <key>developer</key>
        <string>Bluescape</string>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
    </dict>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.download.Bluescape</string>
  <key>Process</key>
  <array>
      <dict>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pathname%</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
      </dict>
  </array>
</dict>
</plist>
