<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Bluejeans app pkg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.munki.bluejeansapp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BluejeansApp</string>
        <key>MUNKI_CATEGORY</key>
        <string>Communications</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Blue Jeans.app/Contents/MacOS/Blue Jeans</string>
                <string>BlueJeans.app/Contents/MacOS/BlueJeans</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Bluejeans video conferencing application</string>
            <key>developer</key>
            <string>Bluejeans</string>
            <key>display_name</key>
            <string>Bluejeans Application</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>preinstall_script</key>
            <string>#!/bin/sh
# remove any existing 1.x version of "Blue Jeans.app"
if [ -e "/Applications/Blue Jeans.app" ]; then
    /bin/rm -rf "/Applications/Blue Jeans.app"
fi
            </string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.bluejeans</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is no longer maintained. If you require it and can find no adequate replacement, consider forking it and maintaining it yourself.</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
