<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Bluejeans web plugin and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.munki.bluejeansplugin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BluejeansPlugin</string>
        <key>MUNKI_CATEGORY</key>
        <string>Communications</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>internet_plugins</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Bluejeans web plugin for Safari and Firefox</string>
            <key>developer</key>
            <string>Bluejeans</string>
            <key>display_name</key>
            <string>Bluejeans Web Plugin</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.pkg.bluejeansplugin</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>