<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Bluejeans app.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.download.bluejeansapp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BluejeansApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>BluejeansAppURLProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>CodeSignatureVerifier</string>   
            <key>Arguments</key>   
            <dict>   
                <key>input_path</key>   
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Blue Jeans Network, Inc. (HE4P42JBGN)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
