<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of BlueJeans and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.pkg.bluejeansapp</string>
    <key>Input</key>
    <dict>
        <key>BUNDLE_ID</key>
        <string>com.bluejeansnet.Blue</string>
        <key>NAME</key>
        <string>BluejeansApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.download.bluejeansapp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/BlueJeans.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
