<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package recipe for Bluejeans app. This recipe replaces a postinstall script 
with a neutered version; the original attempts to change the ownership of the installed
application to the user who performed the install.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.pkg.bluejeansapp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BluejeansApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.download.bluejeansapp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack/BlueJeansSetup.pkg/Scripts/postinstall.sh</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/BlueJeansSetup.pkg/Scripts/postinstall.sh</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_content</key>
                <string>#!/bin/sh
# Placeholder script--just exit with success
exit 0
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%filename%</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>