<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Sublime Text 4, builds a package, and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.gregneagle.munki.SublimeText4</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SublimeText4</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/SublimeText</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
			<key>category</key>
			<string>Text Editors</string>
            <key>description</key>
            <string>Text Editing, Done Right</string>
			<key>developer</key>
			<string>Sublime HQ Pty Ltd</string>
            <key>display_name</key>
            <string>Sublime Text 4</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
	</dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.pkg.SublimeText4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>