<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the SuspiciousPackage app xip archive, and builds a package.
A proof-of-concept example of working with xip archives in case these become more common.
Requires a post-0.5.2 version of the Unarchiver processor to expand the gzip
archive inside the xar archive.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.pkg.suspiciouspackagexip</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SuspiciousPackage</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.3</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.download.suspiciouspackagexip</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Abuse the FlatPkgUnpacker processor: by setting skip_payload to true,
we cause the processor to use xar to expand the xip archive.</string>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>skip_payload</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_format</key>
                <string>gzip</string>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Content</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root/Applications/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root/Applications/Suspicious Package.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleName</key>
                    <string>app_name</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
