<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Install recipe for the SuspiciousPackage app xip archive.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.install.suspiciouspackagexip</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SuspiciousPackage</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.3</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.pkg.suspiciouspackagexip</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>
