<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Defunct recipe.
Download recipe for the SuspiciousPackage app xip archive.
Requires a post-0.5.2 version of CodeSignatureVerifier.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.download.suspiciouspackagexip</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SuspiciousPackage</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is now non-functional. Please remove it from your list of recipes.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
