<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the SuspiciousPackage app xip archive, builds a package,
and imports into your Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.munki.suspiciouspackagexip</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SuspiciousPackage</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>An application for inspecting OS X installer packages</string>
            <key>developer</key>
            <string>Mothers Ruin Software</string>
            <key>display_name</key>
            <string>Suspicious Package</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.3</string>
    <key>ParentRecipe</key>
    <string>com.github.gregneagle.pkg.suspiciouspackagexip</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
