<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Apple installer package for the latest release of podman and imports into Munki.
GITHUB_ARCH: one of "amd64" (for Intel) or "arm64" (for Apple silicon)
MUNKI_ARCH: one of "x86_64" (for Intel) or "arm64" (for Apple silicon)
    </string>
    <key>Identifier</key>
    <string>com.github.autopkg.gregneagle-recipes.munki.podman</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Podman</string>
        <key>GITHUB_ARCH</key>
        <string>amd64</string>
        <key>MUNKI_ARCH</key>
        <string>x86_64</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilities</string>
        <key>MUNKI_PODMAN_DESKTOP_NAME</key>
        <string>PodmanDesktop</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>/opt/podman/qemu/bin/qemu-system-x86_64</string>
                <string>/opt/podman/qemu/bin/qemu-system-aarch64</string>
                <string>/opt/podman/bin/vfkit</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>A tool for managing OCI containers and pods.</string>
            <key>developer</key>
            <string>podman.io</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>installer_environment</key>
            <dict>
                <key>USER</key>
                <string>CURRENT_CONSOLE_USER</string>
            </dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>postuninstall_script</key>
            <string>#!/bin/sh
/bin/rm -r /opt/podman
exit 0
            </string>
            <key>preinstall_script</key>
            <string>#!/bin/sh
if [ -f /opt/podman/bin/podman-mac-helper ] ; then
    /opt/podman/bin/podman-mac-helper uninstall
fi
exit 0
            </string>
            <key>supported_architectures</key>
            <array>
                <string>%MUNKI_ARCH%</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>update_for</key>
            <array>
                <string>%MUNKI_PODMAN_DESKTOP_NAME%</string>
            </array>
        </dict>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.gregneagle-recipes.download.podman</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
