<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest universal Podman Desktop app disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.gregneagle-recipes.download.PodmanDesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PodmanDesktop</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>"(https:\/\/github\.com\/containers\/podman-desktop\/releases\/download\/.*\/podman-desktop-[0-9.]+-universal\.dmg)\"</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://api.github.com/repos/containers/podman-desktop/releases/latest</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Podman Desktop.app</string>
                <key>requirement</key>
                <string>identifier "io.podmandesktop.PodmanDesktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HYSCB8KRL2</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Podman Desktop.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
    </array>
</dict>
</plist>
