<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of P4V (including P4Admin and P4Merge) and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.munki.P4V</string>
    <key>Input</key>
    <dict>
        <key>APP_FILENAME</key>
        <string>P4V</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/perforce</string>
        <key>NAME</key>
        <string>PerforceP4Tools</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Perforce P4 visual and command-line tools. Includes p4v.app, p4admin.app, p4merge.app, and the p4vc command-line tool.</string>
            <key>developer</key>
            <string>Perforce Software</string>
            <key>display_name</key>
            <string>Perforce P4 Tools</string>
            <key>minimum_os_version</key>
            <string>10.13</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.download.P4V</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>path</key>
                            <string>/Applications/p4v.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                        <dict>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>path</key>
                            <string>/Applications/p4admin.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                        <dict>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>path</key>
                            <string>/Applications/p4merge.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>/usr/local/bin/p4vc</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                    </array>
                    <key>items_to_copy</key>
                    <array>
                        <dict>
                            <key>destination_path</key>
                            <string>/Applications</string>
                            <key>source_item</key>
                            <string>p4v.app</string>
                        </dict>
                        <dict>
                            <key>destination_path</key>
                            <string>/Applications</string>
                            <key>source_item</key>
                            <string>p4admin.app</string>
                        </dict>
                        <dict>
                            <key>destination_path</key>
                            <string>/Applications</string>
                            <key>source_item</key>
                            <string>p4merge.app</string>
                        </dict>
                        <dict>
                            <key>destination_path</key>
                            <string>/usr/local/bin</string>
                            <key>source_item</key>
                            <string>p4vc</string>
                        </dict>
                    </array>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
