<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of FoundationDB.
    
Valid values for ARCH include:
- "x86_64" (default, Intel)
- "arm64" (Apple Silicon)
</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.download.FoundationDB</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FoundationDB</string>
        <key>ARCH</key>
        <string>x86_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                        <key>github_repo</key>
                        <string>apple/foundationdb</string>
                        <key>include_prereleases</key>
                        <false/>
                        <key>asset_regex</key>
                        <string>FoundationDB-[\d\.]+_%ARCH%.pkg</string>
                </dict>
        </dict>
        <dict>
                <key>Arguments</key>
                <dict>
                        <key>filename</key>
                        <string>%NAME%-%version%-%ARCH%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
        </dict>
        <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
        </dict>
        <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                        <key>input_path</key>
                        <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Apple Inc. - FoundationDB (MRPEAQGMKG)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                </dict>
        </dict>
    </array>
</dict>
</plist>
