<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of FoundationDB and copies the pkg.</string>
	<key>Identifier</key>
	<string>com.github.gregneagle.pkg.FoundationDB</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gregneagle.download.FoundationDB</string>
  <key>Process</key>
  <array>
      <dict>
          <key>Arguments</key>
          <dict>
              <key>source_pkg</key>
              <string>%pathname%</string>
          </dict>
          <key>Processor</key>
          <string>PkgCopier</string>
      </dict>
  </array>
</dict>
</plist>
